README.org
#+title: Analysis of spectra of Ou 5 planetary nebula



* Layout of this repo
+ ~data/~ contains mainly FITS files
  + ~data/originals~ is the full set of original files from Teresa.
    + It is not included in the repo for space reasons but is available at [[https://drive.google.com/file/d/1xLLAS8lK4L31MmRzrAHUYBETDrKt5v0l/view?usp=drive_web][this Google Drive link.]]
  + ~data/first-look~ is the initial partially reduced spectra from Teresa for reference
    + Also includes a [[file:data/first-look/slit-spm-final-1.pdf][PDF showing the slit positions]].
  + ~docs/~ contains documentation
    + [[file:docs/pn-ou5-pipeline.org]] describes all the steps in the data reduction
    + [[file:docs/pn-ou5-admin.org]] describes setting up the python virtual environment, etc
  + ~notebooks/~ contains jupyter notebooks
  + ~src/~ contains python source code for library functions that are used in the notebooks
