README.md
# Analysis of spectra of Ou 5 planetary nebula



<a id="org83f3e0e"></a>

## Layout of this repo

-   `data/` contains mainly FITS files
    -   `data/originals` is the full set of original files from Teresa.
        -   It is not included in the repo for space reasons but is available at [this Google Drive link.](https://drive.google.com/file/d/1xLLAS8lK4L31MmRzrAHUYBETDrKt5v0l/view?usp=drive_web)
    -   `data/first-look` is the initial partially reduced spectra from Teresa for reference
        -   Also includes a [PDF showing the slit positions](data/first-look/slit-spm-final-1.pdf).
    -   `docs/` contains documentation
        -   <docs/pn-ou5-pipeline.md> describes all the steps in the data reduction
        -   <docs/pn-ou5-admin.md> describes setting up the python virtual environment, etc
    -   `notebooks/` contains jupyter notebooks
    -   `src/` contains python source code for library functions that are used in the notebooks
